Долома/src/Documents/ПроизводственнаяСводка/ПроизводственнаяСводка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственнаяСводка</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ПроизводствоСводка</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БелокМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖирМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДойныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МолокоНаВыпойку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныйБелок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныйЖир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднесуточныйУдой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоварностьМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВаловыйНадой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФуражныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднесуточныйУдойФуражный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Долома/src/Documents/ПроизводственнаяСводка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.Дата		= ТекущаяДата();
		Объект.Автор	= ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма	= Объект.Автор.ОсновнаяФерма;
		Объект.Склад	= Объект.Автор.ОсновнойСклад;
	Иначе
		Белок	= Объект.ПроцентныйБелок;
		Жир 	= Объект.ПроцентныйЖир
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ферма) Тогда
		Если Не ЗначениеЗаполнено(Объект.КоличествоДойныхКоров) Тогда
			СписокЖивотных = ДанныеЖивотных.КоличествоЖивотныхВДойныхКорпусах(Объект.Ферма, Объект.Дата);
			Объект.КоличествоДойныхКоров = СписокЖивотных.Количество();	
		КонецЕсли;  
		Если Не ЗначениеЗаполнено(Объект.КоличествоФуражныхКоров) Тогда
			Объект.КоличествоФуражныхКоров = ДанныеЖивотных.КоличествоФуражныхКоров(Объект.Ферма, Объект.Дата);
		КонецЕсли;  
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ПроцентныйЖир 	= Число(?(ПустаяСтрока(Жир),0,Жир)); 
	Объект.ПроцентныйБелок 	= Число(?(ПустаяСтрока(Белок),0,Белок));
	
КонецПроцедуры

&НаКлиенте
Процедура ВаловыйНадойПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентныйЖирПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентныйБелокПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура МолокоНаВыпойкуПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры


//СЛУЖЕБНЫЕ
&НаСервере
Функция ПересчитатьДанныеМолока()
	
	Объект.ЖирМолока 					= Объект.ВаловыйНадой * Число(?(ПустаяСтрока(Жир),0,Жир)) / 100;
	Объект.БелокМолока 					= Объект.ВаловыйНадой * Число(?(ПустаяСтрока(Белок),0,Белок)) / 100;
	Объект.СреднесуточныйУдой 			= Объект.ВаловыйНадой / Макс(Объект.КоличествоДойныхКоров, 1);
	Объект.ТоварностьМолока 			= 100 - Объект.МолокоНаВыпойку / Макс(Объект.ВаловыйНадой, 1) * 100;
	Объект.СреднесуточныйУдойФуражный 	= Объект.ВаловыйНадой / Макс(Объект.КоличествоФуражныхКоров, 1);
	
КонецФункции

&НаКлиенте
Процедура ФермаПриИзменении(Элемент)
	
	Объект.КоличествоФуражныхКоров = ДанныеЖивотных.КоличествоФуражныхКоров(Объект.Ферма, Объект.Дата);

	СписокЖивотных = ДанныеЖивотных.КоличествоЖивотныхВДойныхКорпусах(Объект.Ферма, Объект.Дата);
	Объект.КоличествоДойныхКоров = СписокЖивотных.Количество();
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры
